//: [Previous](@previous)

import Foundation
import UIKit

/***************************基本数据类型*************************/
/**************************************************************
    1.整数:  Int
    2.浮点数: Double表示64位浮点数,Float表示32位浮点数
    3.布尔类型: Bool,布尔值只有 true 和 false 两种
    4.字符串: String
    5.字符: Character
***************************************************************/


/***************************变量和常量*************************/
/***************************************************************
    1.变量:值能被修改,var 修饰
    2.常量:值不能被修改,let 修饰
***************************************************************/
var a = 20
a = 10
let b = 20
//b = 10  常量不能修改:error:'b' is a 'let' constant


/****************************************************************
    1.会自动推导声明的变量或常量的属性
    2.使用【option + 单击】键查看属性的类型，效果图见:Resources/查看属性.png
****************************************************************/
// 1.自动推导类型
let str = "ningcol"
let intValue = 10
let floatValue = 1.2

// 2.指定数据类型
let doubleValue:Double = 10








//: [Next](@next)
