//: [Previous](@previous)

import Foundation


// 定义一个常量记录函数
func sum(x: Int,y: Int) -> Int{
    return x + y
}

print(sum(x: 20, y: 10))

let fu = sum
print(fu(10, 10))

/***************************最简单的闭包*************************/
// demo 为没有参数,没有返回值的函数(可以省略参数、返回值、in)
let demo = {
    print("hello")
}
demo()

/***************************带参数的闭包*************************/
/**********************************************************************
    1.参数,返回值,实现代码都是写在 {} 中
    2.必须以 "in" 关键字分隔定义和实现
    3.格式: 形参列表 -> 返回值类型 in 实现代码
**********************************************************************/
// 无返回值,有参数
let demo1 = { (x: Int) -> () in
    print(x)
}
demo1(50)

// 有返回值,有参数
let demo2 = {
    (x: Int) -> (Int) in
    return 40 + x
}
print(demo2(40))









//: [Next](@next)
