//: [Previous](@previous)

import Foundation

/**************************if语句*************************/
/*********************************************************************
    1.必须要有大括号
    2.没有"非零即真"的概念，只有ture／false
*********************************************************************/
let num = 20
if num > 10{
    print("大于10");
}else{
    print("小于或等于10")
}

/**************************switch*************************/
/*********************************************************************
    1.值可以是任何类型
    2.作用域仅在 case 内部
    3.不需要 break
    4.每一个 case 都要有代码
*********************************************************************/
let name = "nick"

switch name {
case "nick":
    let age = 18
    print("one  \(age)")
case "fil":
    print("two")
case "Davi":
    print("three")
case "": break  //相当于有一行代码
case "tom","ningcol":
    print("tomAndNingcol")
default:
    print("other")
}







//: [Next](@next)
